# Black Friday Purchase

# Business Problem

The Management team at Walmart Inc. wants to analyze the customer purchase behavior (specifically, purchase amount) against the customer’s gender and the various other factors to help the business make better decisions. They want to understand if the spending habits differ between male and female customers: Do women spend more on Black Friday than men?

# Data Description


The company collected the transactional data of customers who purchased products from Walmart Stores during Black Friday. The dataset in walmart_data.csv has the following features:

User_ID
Product_ID
Gender - sex of a customer
Age - age in bins
Occupation (masked)
City_Category - category of the city [A, B, C]
Stay_In_Current_City_Years: number of years a customer stays in their current city
Marital_Status
Product_Category (masked)
Purchase - purchase amount

In [1]:
# import necessaries libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
import sqlite3
warnings.filterwarnings('ignore')

In [2]:
# import data from database
conn = sqlite3.connect('Purchase.db')

# fetching walmart black friday data
df = pd.read_sql_query('select * from walmart_data',conn)
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,7969

In [3]:
# how many rows and columns
print(f'No. of rows {df.shape[0]}')
print(f'No. of columns {df.shape[1]}')

No. of rows 550068
No. of columns 10

In [4]:
# check data type
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 10 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     550068 non-null  int64
 1   Product_ID                  550068 non-null  object
 2   Gender                      550068 non-null  object
 3   Age                         550068 non-null  object
 4   Occupation                  550068 non-null  int64
 5   City_Category               550068 non-null  object
 6   Stay_In_Current_City_Years  550068 non-null  object
 7   Marital_Status              550068 non-null  int64
 8   Product_Category            550068 non-null  int64
 9   Purchase                    550068 non-null  int64
dtypes: int64(5), object(5)
memory usage: 42.0+ MB

In [5]:
df.isnull().sum()/len(df)*100

User_ID                       0.0
Product_ID                    0.0
Gender                        0.0
Age                           0.0
Occupation                    0.0
City_Category                 0.0
Stay_In_Current_City_Years    0.0
Marital_Status                0.0
Product_Category              0.0
Purchase                      0.0
dtype: float64

In [6]:
# summarize data
df.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
User_ID,550068.0,NaN,NaN,NaN,1003028.842401,1727.591586,1000001.0,1001516.0,1003077.0,1004478.0,1006040.0
Product_ID,550068,3631,P00265242,1880,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Gender,550068,2,M,414259,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Age,550068,7,26-35,219587,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Occupation,550068.0,NaN,NaN,NaN,8.076707,6.52266,0.0,2.0,7.0,14.0,20.0
City_Category,550068,3,B,231173,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Stay_In_Current_City_Years,550068,5,1,193821,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Marital_Status,550068.0,NaN,NaN,NaN,0.409653,0.49177,0.0,0.0,0.0,1.0,1.0
Product_Category,550068.0,NaN,NaN,NaN,5.40427,3.936211,1.0,1.0,5.0,8.0,20.0
Purchase,550068.0,NaN,NaN,NaN,9263.968713,5023.065394,12.0,5823.0,8047.0,12054.0,23961.0

In [7]:
for col in df[['City_Category','Stay_In_Current_City_Years','Marital_Status','Product_Category']]:
    unique_values = df[col].unique()
    print('unique_values in: ',col,unique_values)

unique_values in:  City_Category ['A' 'C' 'B']
unique_values in:  Stay_In_Current_City_Years ['2' '4+' '3' '1' '0']
unique_values in:  Marital_Status [0 1]
unique_values in:  Product_Category [ 3  1 12  8  5  4  2  6 14 11 13 15  7 16 18 10 17  9 20 19]

In [8]:
df['Stay_In_Current_City_Years']=df['Stay_In_Current_City_Years'].str.split('+').str[0].astype('int64')

In [9]:
df['Gender'] = df['Gender'].replace({'M':'Male','F':'Female'})

In [10]:
df['Marital_Status'] = df['Marital_Status'].replace({0:'Married',1:'Unmarried'})

In [11]:
df['Marital_Status'] = df['Marital_Status'].replace({'Unknown':'Unmarried'})

In [12]:
# 'Old_Name' ko 'New_Name' se badalne ke liye
df = df.rename(columns={'Stay_In_Current_City_Years': 'Years'})

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 10 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   User_ID           550068 non-null  int64
 1   Product_ID        550068 non-null  object
 2   Gender            550068 non-null  object
 3   Age               550068 non-null  object
 4   Occupation        550068 non-null  int64
 5   City_Category     550068 non-null  object
 6   Years             550068 non-null  int64
 7   Marital_Status    550068 non-null  object
 8   Product_Category  550068 non-null  int64
 9   Purchase          550068 non-null  int64
dtypes: int64(5), object(5)
memory usage: 42.0+ MB

In [14]:
age_mapping = {
    '0-17': 'Minor',
    '18-25': 'Young Adult',
    '26-35': 'Young Adult',
    '36-45': 'Adult',
    '46-50': 'Adult',
    '51-55': 'Senior',
    '55+': 'Senior'
}

# Naya column banayein
df['Age_Category'] = df['Age'].map(age_mapping)

# Ab iska count dekhein
print(df['Age_Category'].value_counts())

Age_Category
Young Adult    319247
Adult          155714
Senior          60005
Minor           15102
Name: count, dtype: int64

In [15]:
df

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Years,Marital_Status,Product_Category,Purchase,Age_Category
0,1000001,P00069042,Female,0-17,10,A,2,Married,3,8370,Minor
1,1000001,P00248942,Female,0-17,10,A,2,Married,1,15200,Minor
2,1000001,P00087842,Female,0-17,10,A,2,Married,12,1422,Minor
3,1000001,P00085442,Female,0-17,10,A,2,Married,12,1057,Minor
4,1000002,P00285442,Male,55+,16,C,4,Married,8,7969,Senior
...,...,...,...,...,...,...,...,...,...,...,...
550063,1006033,P00372445,Male,51-55,13,B,1,Unmarried,20,368,Senior
550064,1006035,P00375436,Female,26-35,1,C,3,Married,20,371,Young Adult
550065,1006036,P00375436,Female,26-35,15,B,4,Unmarried,20,137,Young Adult
550066,1006038,P00375436,Female,55+,1,C,2,Married,20,365,Senior
550067,1006039,P00371644,Female,46-50,0,B,4,Unmarried,20,490,Adult

In [16]:
# converting columns name into lower cases with underscore
df.columns = df.columns.str.lower()
df.columns = df.columns.str.replace(' ','_')

In [17]:
df

,user_id,product_id,gender,age,occupation,city_category,years,marital_status,product_category,purchase,age_category
0,1000001,P00069042,Female,0-17,10,A,2,Married,3,8370,Minor
1,1000001,P00248942,Female,0-17,10,A,2,Married,1,15200,Minor
2,1000001,P00087842,Female,0-17,10,A,2,Married,12,1422,Minor
3,1000001,P00085442,Female,0-17,10,A,2,Married,12,1057,Minor
4,1000002,P00285442,Male,55+,16,C,4,Married,8,7969,Senior
...,...,...,...,...,...,...,...,...,...,...,...
550063,1006033,P00372445,Male,51-55,13,B,1,Unmarried,20,368,Senior
550064,1006035,P00375436,Female,26-35,1,C,3,Married,20,371,Young Adult
550065,1006036,P00375436,Female,26-35,15,B,4,Unmarried,20,137,Young Adult
550066,1006038,P00375436,Female,55+,1,C,2,Married,20,365,Senior
550067,1006039,P00371644,Female,46-50,0,B,4,Unmarried,20,490,Adult

array(['Married', 'Unmarried'], dtype=object)

In [18]:
# saved manipulated data back into 'walmart_data'
walmart_datas = df.to_sql('walmart_data', conn, if_exists='replace', index=False)
print("Database updated with manipulated data!")

Database updated with manipulated data!

In [19]:
df.to_csv('walmart_datas.csv')